# Taps
tap 'facebook/fb'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'kylef/formulae'
tap 'majd/repo'
tap 'michaeleisel/zld'
tap 'microsoft/git'
tap 'neovim/neovim'
tap 'osx-cross/arm'
tap 'osx-cross/avr'
tap 'qmk/qmk'
tap 'robotsandpencils/made'

# Brews
brew 'adr-tools'
brew 'apktool'
brew 'aria2'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'readline'
brew 'sqlite'
brew 'xz'
brew 'awscli'
brew 'bat'
brew 'blueutil'
brew 'bzip2'
brew 'gettext'
brew 'glib'
brew 'pkg-config'
brew 'cairo'
brew 'carthage'
brew 'ccache'
brew 'certstrap'
brew 'chisel'
brew 'cloc'
brew 'cmake'
brew 'container-diff'
brew 'coreutils'
brew 'ctop'
brew 'jemalloc'
brew 'curl'
brew 'dfu-util'
brew 'docker', link: false
brew 'dtc'
brew 'duf'
brew 'dust'
brew 'exa'
brew 'libtool'
brew 'libsodium'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'go'
brew 'libgpg-error'
brew 'gnupg'
brew 'librsvg'
brew 'graphviz'
brew 'protobuf'
brew 'grpc'
brew 'highlight'
brew 'hivemind'
brew 'htop'
brew 'hyperscan'
brew 'libheif'
brew 'imagemagick'
brew 'libuv'
brew 'ios-sim'
brew 'jq'
brew 'launchdns', restart_service: true
brew 'lcov'
brew 'openjdk'
brew 'leiningen'
brew 'libgit2'
brew 'libtermkey'
brew 'libvterm'
brew 'lsd'
brew 'mas'
brew 'md5sha1sum'
brew 'ninja'
brew 'mint'
brew 'mosh'
brew 'msgpack'
brew 'mysql-client', link: true
brew 'neovim'
brew 'nginx', restart_service: true
brew 'ninja'
brew 'opam'
brew 'openvpn'
brew 'overmind'
brew 'pandoc'
brew 'parallel'
brew 'pinentry-mac'
brew 'proselint'
brew 'ruby-build'
brew 'redis', restart_service: true
brew 'ripgrep'
brew 'rlwrap'
brew 'rust'
brew 'rustup-init'
brew 'shellcheck'
brew 'sourcekitten'
brew 'subversion'
brew 'swiftlint'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'vale'
brew 'wget'
brew 'xcodegen'
brew 'xcproj'
brew 'xctool'
brew 'ykman'
brew 'z'
brew 'zlib'
brew 'zoxide'
brew 'zsh'

brew 'crowdin/crowdin/crowdin@3'
brew 'facebook/fb/idb-companion'
brew 'kylef/formulae/swiftenv'
brew 'lyft/formulae/set-simulator-location'
brew 'michaeleisel/zld/zld'
brew 'osx-cross/avr/avr-gcc@9'
brew 'qmk/qmk/qmk'
brew 'robotsandpencils/made/xcodes'

# Casks
cask 'balance-lock'
cask 'bettertouchtool'
cask 'cron'
cask 'docker'
cask 'fork'
cask 'graphql-playground'
cask 'homebrew/cask-drivers/elgato-control-center'
cask 'homebrew/cask-versions/figma-beta'
cask 'homebrew/cask-versions/slack-beta'
cask 'hot'
cask 'ipatool'
cask 'iterm2'
cask 'kaleidoscope'
cask 'lunar'
cask 'mimestream'
cask 'monodraw'
cask 'muzzle'
cask 'oversight'
cask 'raycast'
cask 'rescuetime'
cask 'secretive'
cask 'sf-symbols'
cask 'sim-genie'
cask 'spotify'
cask 'toolreleases'
cask 'visual-studio-code'
cask 'wwdc'
cask 'xcodes'

# Fonts
cask 'font-fira-code', args: { appdir: '/Applications' }
cask 'font-fira-mono', args: { appdir: '/Applications' }
cask 'font-fira-mono-for-powerline', args: { appdir: '/Applications' }
cask 'font-hack-nerd-font', args: { appdir: '/Applications' }
cask 'font-hasklig', args: { appdir: '/Applications' }
cask 'font-inconsolata-dz-for-powerline', args: { appdir: '/Applications' }
cask 'font-inconsolata-for-powerline', args: { appdir: '/Applications' }
cask 'font-inconsolata-g-for-powerline', args: { appdir: '/Applications' }
cask 'font-iosevka', args: { appdir: '/Applications' }
cask 'font-meslo-for-powerline', args: { appdir: '/Applications' }
cask 'font-meslo-lg', args: { appdir: '/Applications' }
cask 'font-montserrat', args: { appdir: '/Applications' }
cask 'font-open-sans', args: { appdir: '/Applications' }
cask 'font-source-code-pro', args: { appdir: '/Applications' }

# App Store apps
mas '1Password for Safari', id: 1_569_813_296
mas 'Apple Configurator 2', id: 1_037_126_344
mas 'Buildwatch', id: 1_523_347_474
mas 'Calcbot', id: 931_657_367
mas 'Contrast', id: 1_254_981_365
mas 'Dato', id: 1_470_584_107
mas 'Deckset', id: 847_496_013
mas 'Deliveries', id: 924_726_344
mas 'Developer', id: 640_199_958
mas 'Disk Speed Test', id: 425_264_550
mas 'Gifski', id: 1_351_639_930
mas 'iMovie', id: 408_981_434
mas 'Keynote', id: 409_183_694
mas 'Microsoft Excel', id: 462_058_435
mas 'Microsoft Remote Desktop', id: 1_295_203_466
mas 'Numbers', id: 409_203_825
mas 'Okta Extension App', id: 1_439_967_473
mas 'Pages', id: 409_201_541
mas 'Pastebot', id: 1179623856
mas 'Playgrounds', id: 1_496_833_156
mas 'Poolsuite FM', id: 1_514_817_810
mas 'Redacted', id: 984_968_384
mas 'TestFlight', id: 899_247_664
mas 'The Unarchiver', id: 425_424_353
mas 'Things', id: 904_280_696
mas 'Transporter', id: 1_450_874_784
mas 'Tweetbot', id: 1_384_080_005
